blog/2016/04/16/sidekiq/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>Sidekiq原理 - Shane Xu&#39;s Home</title>
    <meta charset="utf-8" />
    <meta name="author" content="Shane Xu" />
      <meta name="description" content="&lt;TODO: insert your description here&gt;" />
      <meta name="keywords" content="sidekiq" />
    <link rel="stylesheet" href="/media/css/org-manual.css" type="text/css">
    <link rel="stylesheet" href="/media/css/code-solarized-dark.css" type="text/css">
  </head>

  <body>
    <div>
      <header class="masthead">
        <h1 class="settitle"><a href="/">Shane Xu&#39;s Home</a></h1>
        <blockquote>Life is too short for so much sorrow.</blockquote>
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="shanexu.io">
        </form>
      </header>
    </div>
    <div class="node nav">
      <ul>
          <li><a href="/blog/" id="Blog_tab">Blog</a></li>
        <li><a href="/tags/">Tags</a></li>
        <li><a href="/about/">About</a></li>
        <li><a href="https://github.com/shanexu">GitHub</a></li>
        <li><a href="/rss.xml">RSS</a></li>
      </ul>
    </div>


  <h3 class="section">Sidekiq原理</h3>
<p>
第一次接触Sidekiq是在前年吧。那时候，为了帮朋友定制一个论坛系统，我选了discourse，然而终究因为它不支持IE8，最后我们放弃了，这是后话。但是这个过程中，我重新拾起了荒废多年的ruby（我好像从来都没有正经学习过ruby），同时我也接触到了一个ruby的后台任务框架——Sidekiq（Simple, efficient background processing for Ruby.）。我那时就是简单的看了看文档和配置，觉得能用就行了。后来，因为自己想着什么时候用scala搞一个后台任务框架，就想什么时候看看Sidekiq的源代码。结果这一念想，过了一年多才得以实现。
</p>

<p>
首先，我们从Sidekiq的源代码中examples目录下的por.rb（plain old ruby）这个例子。
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span class="linenr"> 1: </span><span style="color: #8EBCBB;">require</span> <span style="color: #A2BF8A;">'sidekiq'</span>
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">If your client is single-threaded, we just need a single connection in our Redis connection pool</span>
<span class="linenr"> 4: </span><span style="color: #ECCC87;">Sidekiq</span>.configure_client <span style="color: #80A0C2;">do</span> |config|
<span class="linenr"> 5: </span>  config.redis = <span style="color: #80A0C2;">{</span> <span style="color: #B58DAE;">:namespace</span> =&gt; <span style="color: #A2BF8A;">'x'</span>, <span style="color: #B58DAE;">:size</span> =&gt; <span style="color: #B58DAE; font-weight: bold;">1</span> <span style="color: #80A0C2;">}</span>
<span class="linenr"> 6: </span><span style="color: #80A0C2;">end</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">Sidekiq server is multi-threaded so our Redis connection pool size defaults to concurrency (-c)</span>
<span class="linenr"> 9: </span><span style="color: #ECCC87;">Sidekiq</span>.configure_server <span style="color: #80A0C2;">do</span> |config|
<span class="linenr">10: </span>  config.redis = <span style="color: #80A0C2;">{</span> <span style="color: #B58DAE;">:namespace</span> =&gt; <span style="color: #A2BF8A;">'x'</span> <span style="color: #80A0C2;">}</span>
<span class="linenr">11: </span><span style="color: #80A0C2;">end</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">Start up sidekiq via</span>
<span class="linenr">14: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">./bin/sidekiq -r ./examples/por.rb</span>
<span class="linenr">15: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">and then you can open up an IRB session like so:</span>
<span class="linenr">16: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">irb -r ./examples/por.rb</span>
<span class="linenr">17: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">where you can then say</span>
<span class="linenr">18: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">PlainOldRuby.perform_async "like a dog", 3</span>
<span class="linenr">19: </span><span style="color: #6f7787;">#</span>
<span class="linenr">20: </span><span style="color: #80A0C2;">class</span> <span style="color: #ECCC87;">PlainOldRuby</span>
<span class="linenr">21: </span>  <span style="color: #8EBCBB;">include</span> <span style="color: #ECCC87;">Sidekiq</span>::<span style="color: #ECCC87;">Worker</span>
<span class="linenr">22: </span>
<span class="linenr">23: </span>  <span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">perform</span><span style="color: #80A0C2;">(</span>how_hard=<span style="color: #A2BF8A;">"super hard"</span>, how_long=<span style="color: #B58DAE; font-weight: bold;">1</span><span style="color: #80A0C2;">)</span>
<span class="linenr">24: </span>    <span style="color: #8EBCBB;">sleep</span> how_long
<span class="linenr">25: </span>    <span style="color: #8EBCBB;">puts</span> <span style="color: #A2BF8A;">"Workin' </span><span style="color: #dac6d6;">#{how_hard}</span><span style="color: #A2BF8A;">"</span>
<span class="linenr">26: </span>  <span style="color: #80A0C2;">end</span>
<span class="linenr">27: </span><span style="color: #80A0C2;">end</span>
</pre>
</div>
<p>
我们撇开前面两段配置Sidekiq的代码，直接看第21行的 <code>include Sidekiq::Worker</code> ，在加了这一行代码之后 <code>PlainOldRuby</code> 才会有 <code>perform_async</code> ， <code>perform_in</code> ， <code>perform_at</code> 这三个方法。我们来具体看下 <code>perform_async</code> 方法。
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span class="linenr"> 1: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">perform_async</span><span style="color: #80A0C2;">(</span>*args<span style="color: #80A0C2;">)</span>
<span class="linenr"> 2: </span>  client_push<span style="color: #80A0C2;">(</span><span style="color: #A2BF8A;">'class'</span> =&gt; <span style="color: #80A0C2;">self</span>, <span style="color: #A2BF8A;">'args'</span> =&gt; args<span style="color: #80A0C2;">)</span>
<span class="linenr"> 3: </span><span style="color: #80A0C2;">end</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">client_push</span><span style="color: #80A0C2;">(</span>item<span style="color: #80A0C2;">)</span> <span style="color: #6f7787;"># </span><span style="color: #6f7787;">:nodoc:</span>
<span class="linenr"> 6: </span>  pool = <span style="color: #ECCC87;">Thread</span>.current<span style="color: #80A0C2;">[</span><span style="color: #B58DAE;">:sidekiq_via_pool</span><span style="color: #80A0C2;">]</span> || get_sidekiq_options<span style="color: #80A0C2;">[</span><span style="color: #A2BF8A;">'pool'</span><span style="color: #80A0C2;">]</span> || <span style="color: #ECCC87;">Sidekiq</span>.redis_pool
<span class="linenr"> 7: </span>  hash = <span style="color: #80A0C2;">if</span> <span style="color: #ECCC87;">Thread</span>.current<span style="color: #80A0C2;">[</span><span style="color: #B58DAE;">:sidekiq_worker_set</span><span style="color: #80A0C2;">]</span>
<span class="linenr"> 8: </span>    x, <span style="color: #ECCC87;">Thread</span>.current<span style="color: #80A0C2;">[</span><span style="color: #B58DAE;">:sidekiq_worker_set</span><span style="color: #80A0C2;">]</span> = <span style="color: #ECCC87;">Thread</span>.current<span style="color: #80A0C2;">[</span><span style="color: #B58DAE;">:sidekiq_worker_set</span><span style="color: #80A0C2;">]</span>, <span style="color: #B58DAE;">nil</span>
<span class="linenr"> 9: </span>    x.stringify_keys.merge<span style="color: #80A0C2;">(</span>item.stringify_keys<span style="color: #80A0C2;">)</span>
<span class="linenr">10: </span>  <span style="color: #80A0C2;">else</span>
<span class="linenr">11: </span>    item.stringify_keys
<span class="linenr">12: </span>  <span style="color: #80A0C2;">end</span>
<span class="linenr">13: </span>  <span style="color: #ECCC87;">Sidekiq</span>::<span style="color: #ECCC87;">Client</span>.new<span style="color: #80A0C2;">(</span>pool<span style="color: #80A0C2;">)</span>.push<span style="color: #80A0C2;">(</span>hash<span style="color: #80A0C2;">)</span>
<span class="linenr">14: </span><span style="color: #80A0C2;">end</span>
</pre>
</div>
<p>
在执行 <code>perform_async</code> 的时候，实际上是将传入的参数打包后，再在 <code>client_push</code> 方法中，序列化成string后通过 <code>Sidekiq::Client</code> 的 <code>push</code> 方法发送出去。我们再来看 <code>Sidekiq::Client</code> 中的 <code>push</code> 方法。
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span class="linenr"> 1: </span><span style="color: #6f7787;">##</span>
<span class="linenr"> 2: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">The main method used to push a job to Redis.  Accepts a number of options:</span>
<span class="linenr"> 3: </span><span style="color: #6f7787;">#</span>
<span class="linenr"> 4: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">queue - the named queue to use, default 'default'</span>
<span class="linenr"> 5: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">class - the worker class to call, required</span>
<span class="linenr"> 6: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">args - an array of simple arguments to the perform method, must be JSON-serializable</span>
<span class="linenr"> 7: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">retry - whether to retry this job if it fails, default true or an integer number of retries</span>
<span class="linenr"> 8: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">backtrace - whether to save any error backtrace, default false</span>
<span class="linenr"> 9: </span><span style="color: #6f7787;">#</span>
<span class="linenr">10: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">All options must be strings, not symbols.  NB: because we are serializing to JSON, all</span>
<span class="linenr">11: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">symbols in 'args' will be converted to strings.  Note that +backtrace: true+ can take quite a bit of</span>
<span class="linenr">12: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">space in Redis; a large volume of failing jobs can start Redis swapping if you aren't careful.</span>
<span class="linenr">13: </span><span style="color: #6f7787;">#</span>
<span class="linenr">14: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">Returns a unique Job ID.  If middleware stops the job, nil will be returned instead.</span>
<span class="linenr">15: </span><span style="color: #6f7787;">#</span>
<span class="linenr">16: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">Example:</span>
<span class="linenr">17: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">push('queue' =&gt; 'my_queue', 'class' =&gt; MyWorker, 'args' =&gt; ['foo', 1, :bat =&gt; 'bar'])</span>
<span class="linenr">18: </span><span style="color: #6f7787;">#</span>
<span class="linenr">19: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">push</span><span style="color: #80A0C2;">(</span>item<span style="color: #80A0C2;">)</span>
<span class="linenr">20: </span>  normed = normalize_item<span style="color: #80A0C2;">(</span>item<span style="color: #80A0C2;">)</span>
<span class="linenr">21: </span>  payload = process_single<span style="color: #80A0C2;">(</span>item<span style="color: #B58DAE;">[</span><span style="color: #A2BF8A;">'class'</span><span style="color: #B58DAE;">]</span>, normed<span style="color: #80A0C2;">)</span>
<span class="linenr">22: </span>
<span class="linenr">23: </span>  <span style="color: #80A0C2;">if</span> payload
<span class="linenr">24: </span>    raw_push<span style="color: #80A0C2;">(</span><span style="color: #B58DAE;">[</span>payload<span style="color: #B58DAE;">]</span><span style="color: #80A0C2;">)</span>
<span class="linenr">25: </span>    payload<span style="color: #80A0C2;">[</span><span style="color: #A2BF8A;">'jid'</span><span style="color: #80A0C2;">]</span>
<span class="linenr">26: </span>  <span style="color: #80A0C2;">end</span>
<span class="linenr">27: </span><span style="color: #80A0C2;">end</span>
<span class="linenr">28: </span>
<span class="linenr">29: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">raw_push</span><span style="color: #80A0C2;">(</span>payloads<span style="color: #80A0C2;">)</span>
<span class="linenr">30: </span>  <span style="color: #dac6d6;">@redis_pool</span>.with <span style="color: #80A0C2;">do</span> |conn|
<span class="linenr">31: </span>    conn.multi <span style="color: #80A0C2;">do</span>
<span class="linenr">32: </span>      atomic_push<span style="color: #80A0C2;">(</span>conn, payloads<span style="color: #80A0C2;">)</span>
<span class="linenr">33: </span>    <span style="color: #80A0C2;">end</span>
<span class="linenr">34: </span>  <span style="color: #80A0C2;">end</span>
<span class="linenr">35: </span>  <span style="color: #B58DAE;">true</span>
<span class="linenr">36: </span><span style="color: #80A0C2;">end</span>
<span class="linenr">37: </span>
<span class="linenr">38: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">atomic_push</span><span style="color: #80A0C2;">(</span>conn, payloads<span style="color: #80A0C2;">)</span>
<span class="linenr">39: </span>  <span style="color: #80A0C2;">if</span> payloads.first<span style="color: #80A0C2;">[</span><span style="color: #A2BF8A;">'at'</span><span style="color: #80A0C2;">]</span>
<span class="linenr">40: </span>    conn.zadd<span style="color: #80A0C2;">(</span><span style="color: #A2BF8A;">'schedule'</span>.freeze, payloads.map <span style="color: #80A0C2;">do</span> |hash|
<span class="linenr">41: </span>      at = hash.delete<span style="color: #B58DAE;">(</span><span style="color: #A2BF8A;">'at'</span>.freeze<span style="color: #B58DAE;">)</span>.to_s
<span class="linenr">42: </span>      <span style="color: #B58DAE;">[</span>at, <span style="color: #ECCC87;">Sidekiq</span>.dump_json<span style="color: #A2BF8A;">(</span>hash<span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">]</span>
<span class="linenr">43: </span>    <span style="color: #80A0C2;">end</span><span style="color: #80A0C2;">)</span>
<span class="linenr">44: </span>  <span style="color: #80A0C2;">else</span>
<span class="linenr">45: </span>    q = payloads.first<span style="color: #80A0C2;">[</span><span style="color: #A2BF8A;">'queue'</span><span style="color: #80A0C2;">]</span>
<span class="linenr">46: </span>    now = <span style="color: #ECCC87;">Time</span>.now.to_f
<span class="linenr">47: </span>    to_push = payloads.map <span style="color: #80A0C2;">do</span> |entry|
<span class="linenr">48: </span>      entry<span style="color: #80A0C2;">[</span><span style="color: #A2BF8A;">'enqueued_at'</span>.freeze<span style="color: #80A0C2;">]</span> = now
<span class="linenr">49: </span>      <span style="color: #ECCC87;">Sidekiq</span>.dump_json<span style="color: #80A0C2;">(</span>entry<span style="color: #80A0C2;">)</span>
<span class="linenr">50: </span>    <span style="color: #80A0C2;">end</span>
<span class="linenr">51: </span>    conn.sadd<span style="color: #80A0C2;">(</span><span style="color: #A2BF8A;">'queues'</span>.freeze, q<span style="color: #80A0C2;">)</span>
<span class="linenr">52: </span>    conn.lpush<span style="color: #80A0C2;">(</span><span style="color: #A2BF8A;">"queue:</span><span style="color: #dac6d6;">#{q}</span><span style="color: #A2BF8A;">"</span>, to_push<span style="color: #80A0C2;">)</span>
<span class="linenr">53: </span>  <span style="color: #80A0C2;">end</span>
<span class="linenr">54: </span><span style="color: #80A0C2;">end</span>
<span class="linenr">55: </span>
<span class="linenr">56: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">process_single</span><span style="color: #80A0C2;">(</span>worker_class, item<span style="color: #80A0C2;">)</span>
<span class="linenr">57: </span>  queue = item<span style="color: #80A0C2;">[</span><span style="color: #A2BF8A;">'queue'</span><span style="color: #80A0C2;">]</span>
<span class="linenr">58: </span>
<span class="linenr">59: </span>  middleware.invoke<span style="color: #80A0C2;">(</span>worker_class, item, queue, <span style="color: #dac6d6;">@redis_pool</span><span style="color: #80A0C2;">)</span> <span style="color: #80A0C2;">do</span>
<span class="linenr">60: </span>    item
<span class="linenr">61: </span>  <span style="color: #80A0C2;">end</span>
<span class="linenr">62: </span><span style="color: #80A0C2;">end</span>
<span class="linenr">63: </span>
<span class="linenr">64: </span><span style="color: #6f7787;">##</span>
<span class="linenr">65: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">Define client-side middleware:</span>
<span class="linenr">66: </span><span style="color: #6f7787;">#</span>
<span class="linenr">67: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">client = Sidekiq::Client.new</span>
<span class="linenr">68: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">client.middleware do |chain|</span>
<span class="linenr">69: </span><span style="color: #6f7787;">#     </span><span style="color: #6f7787;">chain.use MyClientMiddleware</span>
<span class="linenr">70: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">end</span>
<span class="linenr">71: </span><span style="color: #6f7787;">#   </span><span style="color: #6f7787;">client.push('class' =&gt; 'SomeWorker', 'args' =&gt; [1,2,3])</span>
<span class="linenr">72: </span><span style="color: #6f7787;">#</span>
<span class="linenr">73: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">All client instances default to the globally-defined</span>
<span class="linenr">74: </span><span style="color: #6f7787;"># </span><span style="color: #6f7787;">Sidekiq.client_middleware but you can change as necessary.</span>
<span class="linenr">75: </span><span style="color: #6f7787;">#</span>
<span class="linenr">76: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">middleware</span><span style="color: #80A0C2;">(</span>&amp;block<span style="color: #80A0C2;">)</span>
<span class="linenr">77: </span>  <span style="color: #dac6d6;">@chain</span> ||= <span style="color: #ECCC87;">Sidekiq</span>.client_middleware
<span class="linenr">78: </span>  <span style="color: #80A0C2;">if</span> <span style="color: #8EBCBB;">block_given?</span>
<span class="linenr">79: </span>    <span style="color: #dac6d6;">@chain</span> = <span style="color: #dac6d6;">@chain</span>.dup
<span class="linenr">80: </span>    <span style="color: #80A0C2;">yield</span> <span style="color: #dac6d6;">@chain</span>
<span class="linenr">81: </span>  <span style="color: #80A0C2;">end</span>
<span class="linenr">82: </span>  <span style="color: #dac6d6;">@chain</span>
<span class="linenr">83: </span><span style="color: #80A0C2;">end</span>
</pre>
</div>
<p>
这里首先读一下注释。然后来看 <code>process_single</code> ，这个方法里面作重要的莫过于 <code>middleware.invoke</code> 这里的代码。 <code>middleware</code> 是什么？如果你有node.js的<a href="http://expressjs.com/">express</a>或者别的框架的开发经验的话，或者直接从字面意思上来看的话可能就会马上理解。 <code>push</code> 方法中有判断 <code>payload</code> 是否为空的代码，如果为空那么这个任务也就不执行了。而 <code>payload</code> 是否为空就是取决于一系列的 <code>Middleware</code> 的作用。我们再来看看 <code>raw_push</code> 方法。这个方法从 <code>pool</code> 中获取了一个连接，并且打开了一个redis的multi命令的上下文，然后交给了 <code>atomic_push</code> 方法。在 <code>atomic_push</code> 方法则将提交过来的任务分成两类，一种是简单的异步任务，它是由调用 <code>perform_async</code> 产生的，一种是定时任务，它是由调用 <code>perform_in</code> 或者 <code>perform_at</code> 产生的，分别用不同的逻辑添加到redis中，这里就不再分析了。至此Sidekiq中提交任务到redis中的过程分析结束。
</p>

<p>
现在任务已经添加到redis中，那么谁来又是在什么时候执行这些任务的呢？
</p>

<p>
我们首先来看一下 <code>Sidekiq::Manager</code> 类。我这里只摘出 <code>initialize</code> 和 <code>start</code> 方法。
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span class="linenr"> 1: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">initialize</span><span style="color: #80A0C2;">(</span>options=<span style="color: #B58DAE;">{}</span><span style="color: #80A0C2;">)</span>
<span class="linenr"> 2: </span>  logger.debug <span style="color: #80A0C2;">{</span> options.inspect <span style="color: #80A0C2;">}</span>
<span class="linenr"> 3: </span>  <span style="color: #dac6d6;">@options</span> = options
<span class="linenr"> 4: </span>  <span style="color: #dac6d6;">@count</span> = options<span style="color: #80A0C2;">[</span><span style="color: #B58DAE;">:concurrency</span><span style="color: #80A0C2;">]</span> || <span style="color: #B58DAE; font-weight: bold;">25</span>
<span class="linenr"> 5: </span>  <span style="color: #8EBCBB;">raise</span> <span style="color: #ECCC87;">ArgumentError</span>, <span style="color: #A2BF8A;">"Concurrency of </span><span style="color: #dac6d6;">#{@count}</span><span style="color: #A2BF8A;"> is not supported"</span> <span style="color: #80A0C2;">if</span> <span style="color: #dac6d6;">@count</span> &lt; <span style="color: #B58DAE; font-weight: bold;">1</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>  <span style="color: #dac6d6;">@done</span> = <span style="color: #B58DAE;">false</span>
<span class="linenr"> 8: </span>  <span style="color: #dac6d6;">@workers</span> = <span style="color: #ECCC87;">Set</span>.new
<span class="linenr"> 9: </span>  <span style="color: #dac6d6;">@count</span>.times <span style="color: #80A0C2;">do</span>
<span class="linenr">10: </span>    <span style="color: #dac6d6;">@workers</span> &lt;&lt; <span style="color: #ECCC87;">Processor</span>.new<span style="color: #80A0C2;">(</span><span style="color: #80A0C2;">self</span><span style="color: #80A0C2;">)</span>
<span class="linenr">11: </span>  <span style="color: #80A0C2;">end</span>
<span class="linenr">12: </span>  <span style="color: #dac6d6;">@plock</span> = <span style="color: #ECCC87;">Mutex</span>.new
<span class="linenr">13: </span><span style="color: #80A0C2;">end</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">start</span>
<span class="linenr">16: </span>  <span style="color: #dac6d6;">@workers</span>.each <span style="color: #80A0C2;">do</span> |x|
<span class="linenr">17: </span>    x.start
<span class="linenr">18: </span>  <span style="color: #80A0C2;">end</span>
<span class="linenr">19: </span><span style="color: #80A0C2;">end</span>
</pre>
</div>
<p>
<code>start</code> 方法其实就是遍历 <code>@wrokers</code> 中的 <code>Sidekiq::Processor</code> 实例，调用其 <code>start</code> 方法。我们来看看 <code>Sidekiq::Processor</code> 中的部分代码。我这里只摘出了 <code>initialize</code> 方法。
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span class="linenr">1: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">initialize</span><span style="color: #80A0C2;">(</span>mgr<span style="color: #80A0C2;">)</span>
<span class="linenr">2: </span>  <span style="color: #dac6d6;">@mgr</span> = mgr
<span class="linenr">3: </span>  <span style="color: #dac6d6;">@down</span> = <span style="color: #B58DAE;">false</span>
<span class="linenr">4: </span>  <span style="color: #dac6d6;">@done</span> = <span style="color: #B58DAE;">false</span>
<span class="linenr">5: </span>  <span style="color: #dac6d6;">@job</span> = <span style="color: #B58DAE;">nil</span>
<span class="linenr">6: </span>  <span style="color: #dac6d6;">@thread</span> = <span style="color: #B58DAE;">nil</span>
<span class="linenr">7: </span>  <span style="color: #dac6d6;">@strategy</span> = <span style="color: #80A0C2;">(</span>mgr.options<span style="color: #B58DAE;">[</span><span style="color: #B58DAE;">:fetch</span><span style="color: #B58DAE;">]</span> || <span style="color: #ECCC87;">Sidekiq</span>::<span style="color: #ECCC87;">BasicFetch</span><span style="color: #80A0C2;">)</span>.new<span style="color: #80A0C2;">(</span>mgr.options<span style="color: #80A0C2;">)</span>
<span class="linenr">8: </span><span style="color: #80A0C2;">end</span>
</pre>
</div>
<p>
在 <code>Processor</code> 启动之后，也就是调用了 <code>start</code> 方法之后， <code>Processor</code> 会通过@strategy的 <code>retrieve_work</code> 方法从redis中获取任务。再来看一下 <code>Sidekiq::BasicFetch</code> 类中的 <code>retrieve_work</code> 方法。
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span class="linenr">1: </span><span style="color: #80A0C2;">def</span> <span style="color: #8EBCBB;">retrieve_work</span>
<span class="linenr">2: </span>  work = <span style="color: #ECCC87;">Sidekiq</span>.redis <span style="color: #80A0C2;">{</span> |conn| conn.brpop<span style="color: #B58DAE;">(</span>*queues_cmd<span style="color: #B58DAE;">)</span> <span style="color: #80A0C2;">}</span>
<span class="linenr">3: </span>  <span style="color: #ECCC87;">UnitOfWork</span>.new<span style="color: #80A0C2;">(</span>*work<span style="color: #80A0C2;">)</span> <span style="color: #80A0C2;">if</span> work
<span class="linenr">4: </span><span style="color: #80A0C2;">end</span>
</pre>
</div>
<p>
可以看到这里调用了redis的 <code>brpop</code> 命令。这是我第一次接触这个命令，说实话虽然用redis也有一段时间了，但是这个<a href="http://redis.io/commands/brpop">BRPOP</a>命令是第一次看见。所以我就去查了下官方文档。
</p>
<blockquote>
<p>
BRPOP is a blocking list pop primitive. It is the blocking version of RPOP because it blocks the connection when there are no elements to pop from any of the given lists. An element is popped from the tail of the first list that is non-empty, with the given keys being checked in the order that they are given.
</p>
</blockquote>
<p>
BRPOP就是RPOP的阻塞版本，当list为空的时候，这个命令就一直阻塞直到超时。当我读完BRPOP的文档之后，我对Sidekiq的原理也基本明了了。
</p>


    <div>
      <div class="post-meta">
        <span title="post date" class="post-info">2016-04-16</span>
        <span title="last modification date" class="post-info">2016-07-09</span>
        <span title="tags" class="post-info"><a href="/tags/ruby/">ruby</a>, <a href="/tags/programming/">programming</a></span>
        <span title="author" class="post-info">Shane Xu</span>
      </div>
      <section>
        <h2 class="chapter">Comments</h2>
        <div id="disqus_thread"></div>
        <script type="text/javascript">
          //var disqus_developer = 1;
          var disqus_identifier = "/blog/2016/04/16/sidekiq";
          var disqus_url = "http://shanexu.io/blog/2016/04/16/sidekiq";
          var disqus_shortname = 'shanexu';
          /* * * DON'T EDIT BELOW THIS LINE * * */
          (function() {
          var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
          dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
          (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
          })();
        </script>
        <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
        <a href="//disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
      </section>
      <script src="/media/js/main.js"></script>
        <script type="text/javascript">
         var _gaq = _gaq || [];
         _gaq.push(['_setAccount', 'UA-74684473-1']);
         _gaq.push(['_trackPageview']);
         (function() {
           var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
           ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
           var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
         })();
        </script>
      <div class="footer">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:xusheng0711@gmail.com">Shane Xu</a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

  </body>
</html>
